//
//  Множественное наследование в Swift.swift
//  SwiftBySundell
//
//  Created by Vlad Gushchin on 29/05/2019.
//  Copyright © 2019 Vladislav Gushin. All rights reserved.
//

import Foundation
/*Существует два основных способа структурирования данных в языках программирования. Можно сказать, что первый из них вытекает из стандартных разделов математики. Данные организованы в виде декартовых продуктов, а языки, поддерживающие такую организацию, известны как функциональные.
 
 Второй подход можно считать производным от биологии и таксономии. Данные организованы в иерархию классов и подклассов, где нижние уровни наследуют все атрибуты, расположенные выше в иерархии. Этот подход называется объектно-ориентированным программированием.
 
 Наследование может быть единичным и множественным. Хотя первое поддерживается в Swift по умолчанию, мы можем очень близко подойти ко второму, применяя определенные методы программирования.
 
 Давайте посмотрим, какие у нас есть варианты в отношении реализации множественного наследования в Swift и какие ограничения она налагает.*/
